doc/translating.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Translating Taf to OCaml</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-01-20 15:41:04 CET"/>
<meta name="author" content="Manuel Simoni"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="stylesheet.css"/>
</head>
<body>
<div id="content">

<h1 class="title">Translating Taf to OCaml</h1>

<p>This document explains how <a href="https://github.com/manuel/taf">Taf</a> code is translated to OCaml for type
checking.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">The Basic Idea </a>
<ul>
<li><a href="#sec-1.1">Taf </a></li>
<li><a href="#sec-1.2">OCaml </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">The Basic Idea </h2>
<div class="outline-text-2" id="text-1">


<p>
The only difference between standard row polymorphism with pattern
matching and Taf is that method definitions may be added anywhere in
the program, and are grouped together into a match expression by the
compiler.
</p>

</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1">Taf </h3>
<div class="outline-text-3" id="text-1.1">





<pre class="example">(define object-1 #(person :name "Manuel" :email "msimoni@gmail.com"))
(define object-2 #(car :brand "Toyota" :build 2008))

(define-generic (print-identification obj))
(define-method (print-identification obj)
  "unknown")
(define-method (print-identification (obj #person))
  (concat (list (^ obj :name) " &lt;" (^ obj :email) "&gt;")))
(define-method (print-identification (obj #car))
  (concat (list (^ obj :name) " (" (string-&gt;number (^ obj :build)) ")")))

(define (whatevs obj)
  (^ obj :name))

(print-identification object-1)
;; ==&gt; "Manuel &lt;msimoni@gmail.com&gt;"
(print-identification object-2)
;; ==&gt; "Toyota (2008)"
(whatevs object-1)
;; ==&gt; "Manuel"
</pre>




</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2">OCaml </h3>
<div class="outline-text-3" id="text-1.2">


<p>
Here's an encoding using a OCaml's OO and a top class.
</p>



<pre class="example">class top =
object
  method print_identification =
    "unknown"
end
class ['a] person (fields : 'a) =
object
  inherit top
  method fields = fields
  method print_identification =
    String.concat "" [fields#name; " &lt;"; fields#email; "&gt;"]
end;;
class ['a] car (fields : 'a) =
object
  inherit top
  method fields = fields
  method print_identification =
    String.concat "" [fields#brand; " &lt;"; string_of_int (fields#build); "&gt;"]
end;;

let whatevs obj =
  obj#fields#name;;

let object_1 = new person (object method name = "Manuel" method email = "msimoni@gmail.com" end);;
let object_2 = new car (object method brand = "Toyota" method build = 2008 end);;
let object_3 = new car (object method brand = "Toyota" method build = 2008 method color = "red" end);;

print_string (object_1#print_identification);;
print_string (object_2#print_identification);;
print_string (object_3#print_identification);;
print_string (whatevs object_1);;
</pre>




<p>
Here's an encoding using polymorphic variants, that can't type
<code>whatevs</code>:
</p>



<pre class="example">let object_1 = `person (object method name = "Manuel" method email = "msimoni@gmail.com" end);;
let object_2 = `car (object method brand = "Toyota" method build = 2008 end);;

let print_identification obj =
  match obj with
  | `person fields -&gt;
      String.concat "" [fields#name; " &lt;"; fields#email; "&gt;"]
  | `car fields -&gt;
      String.concat "" [fields#brand; " &lt;"; string_of_int fields#build; "&gt;"]
  | _ -&gt; "unknown";;

print_string (print_identification object_1);;
print_string (print_identification object_2);;
</pre>



</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Manuel Simoni
<a href="mailto:msimoni@gmail.com">&lt;msimoni@gmail.com&gt;</a>
</p>
<p class="date"> Date: 2013-01-20 15:41:04 CET</p>
</div>
</div>
</body>
</html>
